app/controllers/qrcode_controller.rb

SELECT  "attendances".* FROM "attendances" WHERE "attendances"."date" = ? LIMIT ?  [["date", "2018-07-01"], ["LIMIT", 1]]
SELECT  "students".* FROM "students" ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1000]]
INSERT INTO "attendances" ("email", "date", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "derbesa@gmail.com"], ["date", "2018-07-01"], ["status", 0], ["created_at", "2018-06-30 20:56:35.613523"], ["updated_at", "2018-06-30 20:56:35.613523"]]
INSERT INTO "codes" ("text", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "94s6and9pq"], ["date", "2000-01-01 00:08:28.507921"], ["created_at", "2018-07-01 00:08:28.515730"], ["updated_at", "2018-07-01 00:08:28.515730"]]
---
	def qrcode_encode


		if Attendance.find_by(date: Date.today) == nil
			Student.find_each() do |person|
				Attendance.create(studid: person.studid, date: Date.today, status: false)
			end
		end

		require 'rqrcode'
		key = rand(36**10).to_s(36)

		pass = Code.create(text: key, date: Time.now)